{
  "backend/main.mo": "Main Motoko actor implementing member registration system with access control, user profiles, dynamic form management, and member CRUD operations with role-based authorization (admin/user permissions).",
  "feature_evidence.json": "Empty feature evidence report placeholder with no documented features.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components including routing, authentication, form building, member management, and styling with warm earth-tone color system.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes using neutral grayscale palette, plus chart and sidebar theming.",
  "frontend/index.html": "HTML entry point for PESRON Member Registration application with root div and module script loader.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with three routes (registration, admin, members list), React Query client, Internet Identity authentication, and conditional profile setup modal.",
  "frontend/src/components/FormBuilder.tsx": "Admin form builder component with tabbed interface for creating/editing dynamic registration form fields (text, dropdown, radio, checkbox) with field ordering, validation rules, and live preview functionality.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with PESRON logo header, role-based navigation (registration, admin members list, form builder), authentication-aware login button, and footer with copyright and Caffeine.ai attribution.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity authentication button component handling login/logout with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/MembersTable.tsx": "Displays a table of registered members with columns for ID, name, email, phone, membership type, custom fields, registration date, and status. Includes loading skeletons, empty state, and date/status formatting in Malay.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component that prompts users to enter their name for profile setup. Uses a form with validation and mutation hook to save the profile, preventing dismissal until completed.",
  "frontend/src/components/RegistrationForm.tsx": "Member registration form component with standard fields (name, email, phone, membership type) and dynamic custom fields loaded from current form configuration. Includes validation, success state display, and form reset after submission.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token from URL parameters and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status. Creates AuthClient with configurable options and handles delegation identity validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including member management (get all, register), form operations (get current, upload), user profile management (get, save), and admin role checking.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-toned color palette for both light and dark modes, including primary terracotta, secondary sand, and accent sage colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin page component that displays a members table with authentication and authorization checks, showing access denied alerts for unauthenticated or non-admin users.",
  "frontend/src/pages/FormBuilderPage.tsx": "Form builder page component with admin-only access that allows administrators to create and modify registration form fields.",
  "frontend/src/pages/RegisterPage.tsx": "Public registration page that displays the member registration form with a centered layout and Malay language headers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme values for borders/shadows/fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for PESRON member registration website, listing existing features (registration form, admin view, dynamic fields) and pending backend implementation requests."
}